## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [2]:
# Your code here - remember to use markdown cells for comments as well!
import gzip
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
!ls zippedData

bom.movie_gross.csv
imdb.name.basics.csv
imdb.title.akas.csv
imdb.title.basics.csv
imdb.title.crew.csv
imdb.title.principals.csv
imdb.title.ratings.csv
rt.movie_info.tsv
rt.reviews.tsv
tmdb.movies.csv
tn.movie_budgets.csv

In [149]:

movies_gross = pd.read_csv("zippedData/bom.movie_gross.csv")
#Titles, Studio, Domestic Gross, Foreign Gross and Year
basics_names = pd.read_csv("zippedData/imdb.name.basics.csv")
#Nconst, Primary Name, Primary Profession, Known for titles(title_id)
#just producers
akas= pd.read_csv("zippedData/imdb.title.akas.csv")
#Title ID's, Ordering, Title, Region, Language, Types, Attributes, Original Title
basics_titles = pd.read_csv("zippedData/imdb.title.basics.csv")
#Tconst, Primary Title, Original Title, Start Year, Runtime Minutes, Genres
#crew = pd.read_csv("zippedData/imdb.title.crew.csv")
#Tconst, Directors, Writers
principals = pd.read_csv("zippedData/imdb.title.principals.csv")
#Tconst, Ordering, Nconst, Category, Job, Characters
ratings = pd.read_csv("zippedData/imdb.title.ratings.csv")
#Tconst, Average Rating, Number of Votes
movies = pd.read_csv("zippedData/tmdb.movies.csv")
#Genre Id, Id, Original Language, Original Language, Original Title, Popularity, Release Date, Title, Vote Average, Vote count
movie_budgets = pd.read_csv("zippedData/tn.movie_budgets.csv")
#Id, Release Date, Movie Name, Production Budget, Domestic Gross, Worldwide Gross
reviews = pd.read_csv('zippedData/rt.reviews.tsv', sep = '\t', encoding = 'unicode_escape')
#['id', 'review', 'rating', 'fresh', 'critic', 'top_critic', 'publisher','date']
movie_info = pd.read_csv('zippedData/rt.movie_info.tsv', sep = '\t', encoding = 'unicode_escape')
#['id', 'synopsis', 'rating', 'genre', 'director', 'writer','theater_date', 'dvd_date', 'currency', 'box_office', 'runtime','studio']



#used basics_names, basics_titles, ratings, movie_budgets

In [4]:
basics_names

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
...,...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress,NaN
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer,NaN
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182

In [150]:
producer = (basics_names.loc[basics_names['primary_profession'] == 'producer'])
#finds only information where the primary profession is equal to producer
#save that data frame in in variable called producer 

producer = producer[producer['known_for_titles'].notna()]
#filters out every NAN in the known for titles column
#only wnat producers who have worked on product

producer_shape = producer.shape
#stores the shape of producer

title_codes = producer['known_for_titles'].tolist()
#captures all title keys into a list

p_names = producer['primary_name'].tolist()
#captures list of producer names

ratings = ratings[ratings['tconst'].notna()]
#ratings = ratings[ratings['average'].notna()]

tcodes = ratings['tconst'].tolist()
#list of individual title codes from ratings dataframe

avg_rate = ratings['averagerating'].tolist()
#list of individual rating from ratings

#tcode_rating = [(tcode, rating) for tcode,rating in zip(tcodes, avg_rate)]
#a list of tuples containing the tcode and its rating

tcode_rating_dict = {tcode:rating for tcode,rating in zip(tcodes, avg_rate)}
# dict of tdcodes as key and ratings as values

#relevant_produce = [(nconstant, pname,Know_for_titles) for  in zip(tcodes, avg_rate)]

producer['rating_replace'] = producer['known_for_titles']
#creates a new column in producer with the same information from known for titles
#column will contain a tuple with a title id and a rating in place with the producer

#producer['title_split'] = producer['known_for_titles'].apply(lambda x : x.split(','), producer['known_for_titles'])

producer

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles,rating_replace
69,nm0086850,G. Robert Blakey,1936.0,NaN,producer,"tt0094574,tt0206501,tt9412600,tt2281529","tt0094574,tt0206501,tt9412600,tt2281529"
131,nm0106842,Neil Bregman,1954.0,NaN,producer,"tt0410055,tt0816539,tt0283805,tt0357585","tt0410055,tt0816539,tt0283805,tt0357585"
425,nm0280915,Gerry Flahive,NaN,NaN,producer,"tt0118858,tt0214822,tt3304616,tt0206501","tt0118858,tt0214822,tt3304616,tt0206501"
569,nm0411666,Sandra Itkoff,NaN,NaN,producer,"tt1083853,tt0497398,tt1377278,tt0795174","tt1083853,tt0497398,tt1377278,tt0795174"
883,nm0667045,Martin Paul-Hus,NaN,NaN,producer,"tt0238994,tt0484881,tt2071465,tt0402378","tt0238994,tt0484881,tt2071465,tt0402378"
...,...,...,...,...,...,...,...
606604,nm9959548,Ashok Reddy Gummakonda,NaN,NaN,producer,tt8665746,tt8665746
606613,nm9965935,Harikumar R.,NaN,NaN,producer,tt8688202,tt8688202
606634,nm9985863,Gary Evans,NaN,NaN,producer,"tt0306913,tt8726188","tt0306913,tt8726188"
606635,nm9986856,Geraldine Caster,NaN,NaN,producer,tt8728296,tt8728296
606636,nm9988988,Sarla Verma,NaN,NaN,producer,tt8706386,tt8706386

In [151]:
producer['title_split'] = producer['known_for_titles'].map(lambda x : x.split(','))
#splits comma separated list obj in known_for_titles
producer_names_split_titles = producer[['primary_name', 'title_split']]
producer_names_split_titles

                  primary_name                                   title_split
69            G. Robert Blakey  [tt0094574, tt0206501, tt9412600, tt2281529]
131               Neil Bregman  [tt0410055, tt0816539, tt0283805, tt0357585]
425              Gerry Flahive  [tt0118858, tt0214822, tt3304616, tt0206501]
569              Sandra Itkoff  [tt1083853, tt0497398, tt1377278, tt0795174]
883            Martin Paul-Hus  [tt0238994, tt0484881, tt2071465, tt0402378]
...                        ...                                           ...
606604  Ashok Reddy Gummakonda                                   [tt8665746]
606613            Harikumar R.                                   [tt8688202]
606634              Gary Evans                        [tt0306913, tt8726188]
606635        Geraldine Caster                                   [tt8728296]
606636             Sarla Verma                                   [tt8706386]

[21492 rows x 2 columns]

In [152]:
exploded = producer.explode('title_split')
#used exploded method tpexpand known_title_column into mulitpiple rows

exploded

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles,rating_replace,title_split
69,nm0086850,G. Robert Blakey,1936.0,NaN,producer,"tt0094574,tt0206501,tt9412600,tt2281529","tt0094574,tt0206501,tt9412600,tt2281529",tt0094574
69,nm0086850,G. Robert Blakey,1936.0,NaN,producer,"tt0094574,tt0206501,tt9412600,tt2281529","tt0094574,tt0206501,tt9412600,tt2281529",tt0206501
69,nm0086850,G. Robert Blakey,1936.0,NaN,producer,"tt0094574,tt0206501,tt9412600,tt2281529","tt0094574,tt0206501,tt9412600,tt2281529",tt9412600
69,nm0086850,G. Robert Blakey,1936.0,NaN,producer,"tt0094574,tt0206501,tt9412600,tt2281529","tt0094574,tt0206501,tt9412600,tt2281529",tt2281529
131,nm0106842,Neil Bregman,1954.0,NaN,producer,"tt0410055,tt0816539,tt0283805,tt0357585","tt0410055,tt0816539,tt0283805,tt0357585",tt0410055
...,...,...,...,...,...,...,...,...
606613,nm9965935,Harikumar R.,NaN,NaN,producer,tt8688202,tt8688202,tt8688202
606634,nm9985863,Gary Evans,NaN,NaN,producer,"tt0306913,tt8726188","tt0306913,tt8726188",tt0306913
606634,nm9985863,Gary Evans,NaN,NaN,producer,"tt0306913,tt8726188","tt0306913,tt8726188",tt8726188
606635,nm9986856,Geraldine Caster,NaN,NaN,producer,tt8728296,tt8728296,tt8728296
606636,nm9988988,Sarla Verma,NaN,NaN,producer,tt8706386,tt8706386,tt8706386

In [153]:
prod_title_rate_merge_raw = exploded.merge(ratings, left_on= 'title_split', right_on = 'tconst')
#save teh exploded dataframe to prod_title_rate_raw

prod_title_rate_merge_raw

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles,rating_replace,title_split,tconst,averagerating,numvotes
0,nm0086850,G. Robert Blakey,1936.0,NaN,producer,"tt0094574,tt0206501,tt9412600,tt2281529","tt0094574,tt0206501,tt9412600,tt2281529",tt2281529,tt2281529,8.2,20
1,nm0667045,Martin Paul-Hus,NaN,NaN,producer,"tt0238994,tt0484881,tt2071465,tt0402378","tt0238994,tt0484881,tt2071465,tt0402378",tt2071465,tt2071465,6.0,114
2,nm10165770,Giles Edwards,NaN,NaN,producer,tt9026184,tt9026184,tt9026184,tt9026184,7.0,41
3,nm10191214,Sudhan Sundaram,NaN,NaN,producer,tt8011324,tt8011324,tt8011324,tt8011324,7.1,596
4,nm10183127,Umesh,NaN,NaN,producer,tt8011324,tt8011324,tt8011324,tt8011324,7.1,596
...,...,...,...,...,...,...,...,...,...,...,...
19087,nm9550024,Burak Memisoglu,NaN,NaN,producer,"tt7807064,tt5522892","tt7807064,tt5522892",tt5522892,tt5522892,3.1,127
19088,nm9782183,Peter Stylianou,NaN,NaN,producer,tt2847238,tt2847238,tt2847238,tt2847238,5.7,251
19089,nm9935850,Ajay Kanayalal Sukheja,NaN,NaN,producer,tt8620146,tt8620146,tt8620146,tt8620146,6.2,5
19090,nm9959548,Ashok Reddy Gummakonda,NaN,NaN,producer,tt8665746,tt8665746,tt8665746,tt8665746,7.0,1474
19091,nm9965935,Harikumar R.,NaN,NaN,producer,tt8688202,tt8688202,tt8688202,tt8688202,4.8,6

In [154]:
prod_title_rate_merge = prod_title_rate_merge_raw.drop(['birth_year', 'death_year', 'rating_replace', 'title_split', 'numvotes'], axis=1)
#removed extra tables
prod_title_rate_merge['producer_counts']=(prod_title_rate_merge['primary_name'].value_counts())
#keeps track of how many moveis each producer produced
prod_title_rate_merge.head(20)

#producer_all_title_ids= prod_title_rate_merge[['primary_name', 'known_for_titles']]
#a 2 column data frame containing a producer name and all of the title ids
#titles unsplit, do nont use

prod_title_rate_merge
#producer_all_title_ids

,nconst,primary_name,primary_profession,known_for_titles,tconst,averagerating,producer_counts
0,nm0086850,G. Robert Blakey,producer,"tt0094574,tt0206501,tt9412600,tt2281529",tt2281529,8.2,NaN
1,nm0667045,Martin Paul-Hus,producer,"tt0238994,tt0484881,tt2071465,tt0402378",tt2071465,6.0,NaN
2,nm10165770,Giles Edwards,producer,tt9026184,tt9026184,7.0,NaN
3,nm10191214,Sudhan Sundaram,producer,tt8011324,tt8011324,7.1,NaN
4,nm10183127,Umesh,producer,tt8011324,tt8011324,7.1,NaN
...,...,...,...,...,...,...,...
19087,nm9550024,Burak Memisoglu,producer,"tt7807064,tt5522892",tt5522892,3.1,NaN
19088,nm9782183,Peter Stylianou,producer,tt2847238,tt2847238,5.7,NaN
19089,nm9935850,Ajay Kanayalal Sukheja,producer,tt8620146,tt8620146,6.2,NaN
19090,nm9959548,Ashok Reddy Gummakonda,producer,tt8665746,tt8665746,7.0,NaN
19091,nm9965935,Harikumar R.,producer,tt8688202,tt8688202,4.8,NaN

In [157]:
agg_funcs = {'averagerating': 'mean'}
prod_average = prod_title_rate_merge.groupby(prod_title_rate_merge['primary_name']).aggregate(agg_funcs)
#produces a new dataframe to group by producer name and get the mean of all their ratings

aggr_funcs = {'averagerating': 'mean', 'tconst' : 'count'}
production_rmean_tcount = prod_title_rate_merge.groupby(prod_title_rate_merge['primary_name']).aggregate(aggr_funcs)
#use aggregatem functions 



production_rmean_tcount['primary_namer'] = production_rmean_tcount.index
#adding primary names as a workable column
#column is called tconst but is total count of movies

#prod_average
production_rmean_tcount

                           averagerating  tconst              primary_namer
primary_name
: Hasan Hüseyin Sünbül              4.40       1     : Hasan Hüseyin Sünbül
A. Chidambaram Aanazhagan           6.80       1  A. Chidambaram Aanazhagan
A. David Manoukian                  8.20       1         A. David Manoukian
A. Devarajan                        6.10       1               A. Devarajan
A. Durga Prasad                     7.85       2            A. Durga Prasad
...                                  ...     ...                        ...
Önder Köse                          7.50       2                 Önder Köse
Özgür Tüfekçi                       8.80       1              Özgür Tüfekçi
Özgür Yapimlar                      3.20       1             Özgür Yapimlar
Ücgen Yapim Evi                     3.80       1            Ücgen Yapim Evi
Ünsal Meseci                        6.20       3               Ünsal Meseci

[13460 rows x 3 columns]

In [99]:
total_producer_rating =prod_average.sort_values(by ='averagerating', ascending=False)
#final df with the producees anme and the average rating score of every movie theyve produced
"""prod_avg_top20= prod_average.sort_values(by ='averagerating', ascending=False).head(20)
#gets top 20 name and top 20 ratings
prod_avg_top20_rate_list= prod_avg_top20['averagerating'].tolist()
#makes a list of the top 20 ratings

prod_avg_top20_name_list= prod_avg_top20.index.tolist()
#all_producer_name= prod_avg_
#makes a lsit of the top 20 names

fig, ax = plt.subplots()
#creates a plot
ax.barh( prod_avg_top20_name_list, prod_avg_top20_rate_list)
#creates a bar chart with names as the x and ratings as the y)
ax.set_title('Top 20 producers and ratings')
prod_avg_top40= prod_average.sort_values(by ='averagerating', ascending=False).head(40)
#takes the top 40 highest rated producers
type(total_producer_rating)"""

total_producer_rating['primary_names'] = total_producer_rating.index
#creates another column that holds producer names
total_producer_rating = total_producer_rating.rename(columns={'averagerating': 'mean_rating', 'primary_names': 'primary_names'})



#total_producer_rating

                    mean_rating       primary_names
primary_name
Daniel Dennis               9.8       Daniel Dennis
Steven D. Kramer            9.8    Steven D. Kramer
Mikey Meegan                9.8        Mikey Meegan
Tom Vann                    9.8            Tom Vann
Saba Kikoliashvili          9.6  Saba Kikoliashvili
...                         ...                 ...
Shôei Miyata                1.0        Shôei Miyata
Shu-Ning Liao               1.0       Shu-Ning Liao
Hiroaki Fujishima           1.0   Hiroaki Fujishima
Yukine Nakamura             1.0     Yukine Nakamura
Wanlin Tsai                 1.0         Wanlin Tsai

[13460 rows x 2 columns]

In [159]:
tconst_ptitle_genres =basics_titles[['tconst', 'primary_title', 'genres']]
#subset of basics_titles containing just the title id, teh primary title of the movie and its genres
tconst_pname_avgRate = prod_title_rate_merge[['tconst', 'primary_name', 'averagerating']]
#subset of prod_title_rate_merge that conatians just the title ids, the producer name, and the average rating
tconst_to_title_merge = tconst_pname_avgRate.merge(tconst_ptitle_genres, left_on= 'tconst', right_on='tconst')
#subset of data merged on title id to look like: title id, producer name, average rating, movie title, movie genre


#tconst_ptitle_genres
#tconst, primary_title, genres
#tt0063540, Sunghursh, action, crime, drama
#146144 rows × 3 columns

#tconst_pname_avgRate
#tconst, primary_name, averagerating
#tt228,  G. Robert Blakely, 8.2
#19092 rows × 3 columns

tconst_to_title_merge
#tconst, primary_name,  averagerating, primary_title,               genres
#tt228,  G. Robert Blakely, 8.2,       The wall STreet Conspiracy, documentary
#19092 rows × 5 columns

,tconst,primary_name,averagerating,primary_title,genres
0,tt2281529,G. Robert Blakey,8.2,The Wall Street Conspiracy,Documentary
1,tt2071465,Martin Paul-Hus,6.0,Friends from France,"Adventure,Drama,History"
2,tt9026184,Giles Edwards,7.0,Girl on the Third Floor,Horror
3,tt8011324,Sudhan Sundaram,7.1,Seethakaathi,Drama
4,tt8011324,Umesh,7.1,Seethakaathi,Drama
...,...,...,...,...,...
19087,tt5522892,Burak Memisoglu,3.1,Azazil 2: Büyü,"Horror,Thriller"
19088,tt2847238,Peter Stylianou,5.7,Who Needs Enemies,"Crime,Drama,Thriller"
19089,tt8620146,Ajay Kanayalal Sukheja,6.2,Re Raya,Sport
19090,tt8665746,Ashok Reddy Gummakonda,7.0,Rx 100,"Action,Drama"
19091,tt8688202,Harikumar R.,4.8,Ennaalum Sarath..?,"Mystery,Thriller"

In [161]:
#movie_budgets
name_budget_gross_rDAte=movie_budgets[['movie', 'production_budget', 'domestic_gross', 'worldwide_gross', 'release_date']]
#subset of movie_budget containing : Release Date, Movie Name, Production Budget, Domestic Gross, Worldwide Gross

merge_check_movie_budgets = name_budget_gross_rDAte.merge(tconst_to_title_merge, left_on='movie', right_on ='primary_title' )
#called merege_check to check data, worried because I saw a
#dramatic change in number of rows
#could be problematic
merge_check_movie_budgets
#upon looking I noticed it showed that multiple producers worked on one movies, may present problems
movies_gross_noNAN=movies_gross.dropna()
#moive_gross with no NAN values
#Titles, Studio, Domestic Gross, Foreign Gross and Year
movies_gross_noNAN

merge_check_movies_gross = movies_gross_noNAN.merge(tconst_to_title_merge, left_on='title', right_on ='primary_title' )
#merge of movies_gross_noNAN and tconst_to_title_merge, mereg eon movies name
#should contain title, studio, domestic gross, foreign gross, year, producer name, average rating, title, genres

merge_check_movies_gross
#len = 524
#print(len(merge_check_movie_budgets.movie), len(merge_check_movies_gross.title))

#name_budget_gross_rDAte
#merge_check_movie_budgets
#movies_gross_noNAN
merge_check_movies_gross

list_of_title_ids = merge_check_movies_gross['tconst'].tolist()
#list title ids
list_of_title_names = merge_check_movies_gross['primary_title'].tolist()
#list of title name

title_dict = [{key : val} for key, val in zip(list_of_title_ids, list_of_title_names)]
#len(title_dict)

merge_check_movies_gross

,title,studio,domestic_gross,foreign_gross,year,tconst,primary_name,averagerating,primary_title,genres
0,The King's Speech,Wein.,135500000.0,275400000,2010,tt1504320,Iain Canning,8.0,The King's Speech,"Biography,Drama,History"
1,The Karate Kid,Sony,176600000.0,182500000,2010,tt1155076,Xiaoli Han,6.2,The Karate Kid,"Action,Drama,Family"
2,Black Swan,FoxS,107000000.0,222400000,2010,tt0947798,Brian Oliver,8.0,Black Swan,"Drama,Thriller"
3,Black Swan,FoxS,107000000.0,222400000,2010,tt0947798,Tyler Thompson,8.0,Black Swan,"Drama,Thriller"
4,Robin Hood,Uni.,105300000.0,216400000,2010,tt0955308,Michael Costigan,6.6,Robin Hood,"Action,Adventure,Drama"
...,...,...,...,...,...,...,...,...,...,...
519,7 Days in Entebbe,Focus,3300000.0,5400000,2018,tt5466186,Kobi Holly,5.8,7 Days in Entebbe,"Action,Drama,History"
520,Suspiria,Amazon,2500000.0,5400000,2018,tt1034415,Francesco Melzi d'Eril,6.8,Suspiria,"Fantasy,Horror,Mystery"
521,Suspiria,Amazon,2500000.0,5400000,2018,tt1034415,Gabriele Moratti,6.8,Suspiria,"Fantasy,Horror,Mystery"
522,Wildlife,IFC,1100000.0,2000000,2018,tt5929754,Andrew Duncan,6.9,Wildlife,Drama
523,Antonio Lopez 1970: Sex Fashion & Disco,FM,43200.0,30000,2018,tt5792490,Ronnie Sassoon,6.5,Antonio Lopez 1970: Sex Fashion & Disco,"Biography,Documentary"

In [158]:
merge_check_movie_budgets
#dataframe_name[dataframe_name['column'] != '$0']
merge_check_movie_budgets[merge_check_movie_budgets['worldwide_gross'] != '$0']
#removes any rows with no currency valur
#df['col_to_clean'] = df['col_to_clean'].apply(lambda x: x.replace('$', '')).apply(lambda x: x.replace(',', '')).astype(np.int64)
merge_check_movie_budgets['total_income'] = merge_check_movie_budgets['worldwide_gross'].apply(lambda x: x.replace('$', '')).apply(lambda x: x.replace(',', '')).astype(np.int64)
#takes worldwide_gross currency string values and turns them into integers and puts them in a new column
merge_check_movie_budgets['prod_budget'] = merge_check_movie_budgets['production_budget'].apply(lambda x: x.replace('$', '')).apply(lambda x: x.replace(',', '')).astype(np.int64)
#takes production budget currency string values and turns them into integers and puts them in a new column
name_prodBudg_Tincome=merge_check_movie_budgets[['primary_name','prod_budget', 'total_income']]
#creates a subset dataframe of just the producer name, the production budget and the worldwide gross income
name_prodBudg_Tincome['total_income_real'] = name_prodBudg_Tincome['total_income']- name_prodBudg_Tincome['prod_budget']
# creates new column htat shows the net income of the world wide gross income minus the production budget
name_prodBudg_Tincome
#prod_avg_top20_name_list #####this is the list of 20 producers names

#merge_check_movies_gross = movies_gross_noNAN.merge(tconst_to_title_merge, left_on='title', right_on ='primary_title' )
#name_budge_income_rating = name_prodBudg_Tincome.merge(total_producer_rating, left_on= 'primary_name', right_on= 'primary_names')
name_budge_income_meanProdRating = total_producer_rating.merge(name_prodBudg_Tincome, left_on= 'primary_names', right_on= 'primary_name')
#mean rating, primary names, primary name, prod budget, total income, total income real
rmean_pnames_pbudget_gincome_nincome = name_budge_income_meanProdRating[['mean_rating', 'primary_name', 'prod_budget', 'total_income', 'total_income_real']]
#creates a new dataframe that consist of mean_rating, primary names, production budget, gross income, net income

#name_budge_income_rating
#name_budge_income_meanProdRating.head(30)
rmean_pnames_pbudget_gincome_nincome

#agg_funcs = {'averagerating': 'mean'}
#prod_average = prod_title_rate_merge.groupby(prod_title_rate_merge['primary_name']).aggregate(agg_funcs)
#produces a new dataframe to group by producer name and get the mean of all their ratings

agg_functions= {'prod_budget': 'mean', 'total_income' : 'mean', 'total_income_real' : 'mean'}
producers_averages = rmean_pnames_pbudget_gincome_nincome.groupby(rmean_pnames_pbudget_gincome_nincome['primary_name']).aggregate(agg_functions)
#group by producer names and gets teh production mean for all of each producers movies, gross income mean, and net income mean

producers_averages = producers_averages.rename(columns={'prod_budget' : 'production_budget_mean', 'total_income' : 'gross_income_mean', 'total_income_real' : 'net_income_mean'})
#renames column names to better suited names

#sns.scatterplot(data=producers_averages, x="production_budget_mean", y="net_income_mean")
#creates a scatter plot showing the relationship between production budget means and net incomes means for each producer

means_counts_names=production_rmean_tcount.merge(producers_averages, left_on = 'primary_namer', right_on = 'primary_name')
#add title counts  and mean ratings to producer name, budget mean, nte income mean and production mean


#data.rename(columns={'gdp':'log(gdp)'}, inplace=True)
means_counts_names.rename(columns={'averagerating' : 'mean_rating', 'tconst' : 'title_counts', 'primary_namer' : 'producer_name'}, inplace = True)
#renames columns for clarity

#production_rmean_tcount
#primary_name index, averagerating, tconst, primary name

#merge_check_movie_budgets
#name_prodBudg_Tincome
#name_budge_income_meanProdRating 
#rmean_pnames_pbudget_gincome_nincome
#producers_averages


#means_counts_names


means_counts_names_titles = means_counts_names.merge(producer_names_split_titles, left_on = 'producer_name', right_on= 'primary_name')
#merges dataframes too have all means, producers names, title coutns, title id lists
means_counts_names_titles

title_split_list = means_counts_names_titles['title_split'].tolist()
#creates a list of lists where each list is a list of title codes
#titlename_list = []
#for i in title_split_list:
#    for j in i:
#        for t in range(0, len(list_of_title_ids):
#                       if j == list_of_title_ids[t]:
#                           titlename_list.append(list_)

means_counts_names_titles

<ipython-input-158-9b7a81148862>:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  name_prodBudg_Tincome['total_income_real'] = name_prodBudg_Tincome['total_income']- name_prodBudg_Tincome['prod_budget']

,mean_rating,title_counts,producer_name,production_budget_mean,gross_income_mean,net_income_mean,primary_name,title_split
0,7.400,1,Aaron Woolf,10000000.0,9263940.0,-736060.0,Aaron Woolf,[tt5897002]
1,6.200,3,Aashish Singh,17500000.0,42356700.5,24856700.5,Aashish Singh,"[tt5956100, tt4832640, tt0871510, tt1833673]"
2,8.600,1,Abigail Evans,180000.0,17503.0,-162497.0,Abigail Evans,[tt2421956]
3,6.550,4,Adam Siegel,32000000.0,70629913.5,38629913.5,Adam Siegel,"[tt1272878, tt1385867, tt5834262, tt0780504]"
4,7.775,4,Adnan M. Sapci,1400000.0,5552584.0,4152584.0,Adnan M. Sapci,"[tt8090580, tt5334076, tt5313746, tt3966404]"
...,...,...,...,...,...,...,...,...
608,5.500,1,Zarah Shah,15000000.0,9352500.5,-5647499.5,Zarah Shah,[tt2187167]
609,5.950,2,Zoe Hobson,5000000.0,16515203.0,11515203.0,Zoe Hobson,"[tt1329407, tt3465626, tt2536124, tt1529567]"
610,6.000,1,Zoë Chun-Jung Chen,15000000.0,59168692.0,44168692.0,Zoë Chun-Jung Chen,[tt1616203]
611,7.600,1,Álvaro Augustin,40000000.0,169590606.0,129590606.0,Álvaro Augustin,"[tt1186830, tt1649419, tt1242422, tt0457430]"
612,5.100,1,Ç. Duygu Bingöl,15000000.0,1148578.0,-13851422.0,Ç. Duygu Bingöl,"[tt1535612, tt0826606, tt0880502, tt1373215]"

In [52]:
top_20_producers=pd.DataFrame(prod_avg_top20_name_list, columns=['primary_name'])
top_20_producers
#name_prodBudg_Tincome #### merge on name ['primary_name']
#merge_check_movie_budgets = name_budget_gross_rDAte.merge(tconst_to_title_merge, left_on='movie', right_on ='primary_title' )
#top_20_prod_budg_income = top_20_producers.merge(name_prodBudg_Tincome, left_on='producer_names', right_on='primary_name')
#top_20_prod_budg_income = name_prodBudg_Tincome.merge(top_20_producers, left_on= 'primary_name', right_on='producer_names')
#top_20_prod_budg_income

#df.join(other.set_index('key'), on='key')
#joined = top_20_producers.join(name_prodBudg_Tincome.set_index('primary_name'), on = 'primary_name')

#Df1.name.isin(Df2.IDs).astype(int)


#top_20_producers['primary_name'].isin(name_prodBudg_Tincome['primary_name']).astype(int)

0     0
1     0
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    0
11    0
12    0
13    0
14    0
15    0
16    0
17    0
18    0
19    0
Name: primary_name, dtype: int32

In [ ]:
def producer profiles(name, df1, df2):